[
    {
        "id":1,
        "title":"Hardware-Assisted Software Security",
        "image":"/group/hardware.png",
        "display":false,
        "desc":"Our research group focuses on enhancing software security by leveraging hardware-level information, functions, and features. We combine hardware and software security mechanisms to detect, protect, and repair security vulnerabilities in software systems. By utilizing hardware-assisted technologies such as Intel SGX and ARM TrustZone, we achieve higher detection accuracy, low-overhead security monitoring, and stronger anti-tampering capabilities. These techniques help identify malicious behaviors, isolate sensitive data, and support rapid system recovery in the event of an attack."
    },
    {
        "id":3,
        "title":"Formalization and Cryptographic Security",
        "image":"/group/formalization.png",
        "display":false,
        "desc":"The Formalization and Cryptographic Security Research Group focuses on the security of cryptographic protocols and formal verification methods.Leveraging program analysis methods (e.g., taint analysis and parameter tracking) and symbolic analysis methods (e.g., formal analysis), our research rigorously examines the security and integrity of cryptographic protocols and systems. Our work enhances the robustness of cryptographic implementations and provides the industry with actionable frameworks and tools for secure protocol design, contributing to the advancement of secure and reliable cyber infrastructures."
    },
    {
        "id":2,
        "title":"Fuzzing and Protocol Security",
        "image":"/group/fuzzing.png",
        "display":false,
        "desc":"The Fuzzing and Protocol Security Research Group focuses on the security of network protocols and APIs, employing advanced fuzzing techniques to analyze and detect security vulnerabilities in various protocols and interfaces. Our research enhances protocol robustness and provides the industry with actionable frameworks and tools for security testing, thereby contributing to the broader goal of cybersecurity."
    },
    {
        "id":4,
        "title":"Artificial Intelligence Security",
        "image":"/group/AI.png",
        "display":false,
        "desc":"The AI Security field is dedicated to studying the security, privacy, and safety of AIGC applications from both attack and defense perspectives. As AIGC technology is widely applied across various industries, AI systems, while improving efficiency and intelligence, also face unprecedented security challenges. Research in the AI Security field covers a broad range of topics, including security vulnerabilities in AI systems, data privacy leakage, malicious attacks and defense mechanisms, as well as the potential social, ethical, and legal impacts of AI technology."
    }

]